[
  "table-editor-obsidian",
  "heatmap-calendar",
  "colored-text",
  "obsidian-style-settings",
  "obsidian-excalidraw-plugin",
  "obsidian-icon-folder",
  "tag-wrangler",
  "templater-obsidian",
  "obsidian-tagfolder",
  "obsidian-relative-line-numbers",
  "homepage"
]