## Etapas da Configuração Básica de um Roteador

As tarefas a seguir devem ser concluídas ao configurar as configurações iniciais em um roteador.

1. Configurar o nome do dispositivo.

```
Router(config)# hostname _hostname_
```

2. Proteger o modo EXEC privilegiado.

```
Router(config)# enable secret _password_
```

3. Proteger o modo EXEC usuário.

```
Router(config)# line console 0  
Router(config-line)# password _password_  
Router(config-line)# login
```

4. Proteger o acesso remoto Telnet/SSH

```
Router(config-line)# line vty 0 4  
Router(config-line)# password _password_  
Router(config-line)# login
Router(config-line)# transport input {ssh | telnet}
```

5. Proteger todas as senhas do arquivo de configuração.

```
Router(config-line)# exit  
Router(config)# service password-encryption
```

6. Apresentar a notificação legal.

```
Router(config)# banner motd _delimiter message delimiter_
```

7. Salvar a configuração.

```
Router(config)# end
Router# copy running-config startup-config
```

---

## Exemplo de configuração básica do roteador

Neste exemplo, o roteador R1 no diagrama de topologia será configurado com as configurações iniciais

![[Pasted image 20240619004642.png]]

Para configurar o nome do dispositivo para R1, use os seguintes comandos.

```
Router> enable 
Router# configure terminal 
Enter configuration commands, one per line.
End with CNTL/Z.
Router(config)# hostname R1 
R1(config)#
```

**Observação:** Observe como o prompt do roteador agora exibe o nome do host do roteador.

Todo o acesso ao roteador deve ser protegido. O modo EXEC privilegiado fornece ao usuário acesso completo ao dispositivo e sua configuração. Portanto, é o modo mais importante para proteger.

Os comandos a seguir protegem o modo EXEC privilegiado e o modo EXEC do usuário, habilitam o acesso remoto Telnet e SSH e criptografam todas as senhas de texto simples (ou seja, EXEC do usuário e linha VTY).

```
R1(config)# enable secret class 
R1(config)#
R1(config)# line console 0 
R1(config-line)# password cisco 
R1(config-line)# Login 
R1(config-line)# exit 
R1(config)#
R1(config)# line vty 0 4 
R1(config-line)# password cisco 
R1(config-line)# Login 
R1(config-line)# transport input ssh telnet 
R1(config-line)# exit 
R1(config)#
R1(config)# service password-encryption 
R1(config)#
```

A notificação legal avisa os usuários de que o dispositivo só deve ser acessado por usuários permitidos. A notificação legal é configurada da seguinte forma.

```
R1(config)# banner motd #
Digite a mensagem de texto. Termine com uma nova linha e o #
*********************************************** 
AVISO: O acesso não autorizado é proibido!
***********************************************
#
R1(config)#
```

Se os comandos anteriores foram configurados e o roteador perdeu energia acidentalmente, todos os comandos configurados seriam perdidos. Por esse motivo, é importante salvar a configuração quando as alterações são implementadas. O comando a seguir salva a configuração na NVRAM.

```
R1# copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#
```